app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = 13
---

<% @author.books.each do |book| %>