app/views/books/_form.html.erb

  <%= f.label :author_id %>
  <%= f.select :author_id, Author.all.map {|author| [author.name, author.id]},
   :include_blank => true, :prompt => 'select author' %><br/>
---
SELECT "authors".* FROM "authors"