app/controllers/authors_controller.rb

  def create
    author = Author.create(params[:author])
---
INSERT INTO "authors" ("bio", "created_at", "genre", "image", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bio", "lklkl"], ["created_at", Wed, 03 Jul 2013 15:19:58 UTC +00:00], ["genre", "lk"], ["image", "lklk"], ["name", "opopeopi"], ["updated_at", Wed, 03 Jul 2013 15:19:58 UTC +00:00]]

  def edit
    @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    author = Author.find(params[:id])
    author.update_attributes(params[:author])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", "15"]]
UPDATE "authors" SET "image" = 'http://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Stephen_King%2C_Comicon.jpg/471px-Stephen_King%2C_Comicon.jpg', "updated_at" = '2013-07-03 23:27:33.912213' WHERE "authors"."id" = 13

  def destroy
    author = Author.find(params[:id])
    author.destroy
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", "16"]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 16]]