app/controllers/books_controller.rb

INSERT INTO "books" ("author_id", "created_at", "description", "image", "isbn", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    book = Book.create(params[:book])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", "17"]]
UPDATE "books" SET "image" = 'http://upload.wikimedia.org/wikipedia/en/f/f7/Greenmilepart1.jpg', "author_id" = 13, "updated_at" = '2013-07-03 23:37:01.405730' WHERE "books"."id" = 17
---
  def update
    book = Book.find(params[:id])
    book.update_attributes(params[:book])